In [2]:
import pandas as pd

In [2]:
df=pd.read_csv('GlobalLandTemperaturesByCity.csv')

In [46]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [11]:
df.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1743-11-01,6.068,1.737,Århus,Denmark,57.05N,10.33E
1,1743-12-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
2,1744-01-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
3,1744-02-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
4,1744-03-01,NaN,NaN,Århus,Denmark,57.05N,10.33E

In [12]:
df.tail()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
8599207,2013-05-01,11.464,0.236,Zwolle,Netherlands,52.24N,5.26E
8599208,2013-06-01,15.043,0.261,Zwolle,Netherlands,52.24N,5.26E
8599209,2013-07-01,18.775,0.193,Zwolle,Netherlands,52.24N,5.26E
8599210,2013-08-01,18.025,0.298,Zwolle,Netherlands,52.24N,5.26E
8599211,2013-09-01,NaN,NaN,Zwolle,Netherlands,52.24N,5.26E

In [3]:
df.shape

(8599212, 7)

In [10]:
df.dtypes

dt                                object
AverageTemperature               float64
AverageTemperatureUncertainty    float64
City                              object
Country                           object
Latitude                          object
Longitude                         object
dtype: object

In [7]:
df.isnull().sum()

dt                                    0
AverageTemperature               364130
AverageTemperatureUncertainty    364130
City                                  0
Country                               0
Latitude                              0
Longitude                             0
dtype: int64

In [14]:
df.describe()

       AverageTemperature  AverageTemperatureUncertainty
count        8.235082e+06                   8.235082e+06
mean         1.672743e+01                   1.028575e+00
std          1.035344e+01                   1.129733e+00
min         -4.270400e+01                   3.400000e-02
25%          1.029900e+01                   3.370000e-01
50%          1.883100e+01                   5.910000e-01
75%          2.521000e+01                   1.349000e+00
max          3.965100e+01                   1.539600e+01

In [15]:
df=df.dropna(how='any',axis=0)

In [16]:
df.isnull().sum()

dt                               0
AverageTemperature               0
AverageTemperatureUncertainty    0
City                             0
Country                          0
Latitude                         0
Longitude                        0
dtype: int64

In [18]:
df.shape

(8235082, 7)

In [19]:
df.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1743-11-01,6.068,1.737,Århus,Denmark,57.05N,10.33E
5,1744-04-01,5.788,3.624,Århus,Denmark,57.05N,10.33E
6,1744-05-01,10.644,1.283,Århus,Denmark,57.05N,10.33E
7,1744-06-01,14.051,1.347,Århus,Denmark,57.05N,10.33E
8,1744-07-01,16.082,1.396,Århus,Denmark,57.05N,10.33E

In [21]:
df.describe()

       AverageTemperature  AverageTemperatureUncertainty
count        8.235082e+06                   8.235082e+06
mean         1.672743e+01                   1.028575e+00
std          1.035344e+01                   1.129733e+00
min         -4.270400e+01                   3.400000e-02
25%          1.029900e+01                   3.370000e-01
50%          1.883100e+01                   5.910000e-01
75%          2.521000e+01                   1.349000e+00
max          3.965100e+01                   1.539600e+01

In [24]:
df.dtypes

dt                                object
AverageTemperature               float64
AverageTemperatureUncertainty    float64
City                              object
Country                           object
Latitude                          object
Longitude                         object
dtype: object

In [40]:
df.rename(columns={'dt':'Date','AverageTemperature':'Avg_temp','AverageTemperatureUncertainty':'Avg_temp_cert'}, )
df.head()

         Date  Avg_temp  Avg_temp_cert   City  Country Latitude Longitude
0  1743-11-01     6.068          1.737  Århus  Denmark   57.05N    10.33E
5  1744-04-01     5.788          3.624  Århus  Denmark   57.05N    10.33E
6  1744-05-01    10.644          1.283  Århus  Denmark   57.05N    10.33E
7  1744-06-01    14.051          1.347  Århus  Denmark   57.05N    10.33E
8  1744-07-01    16.082          1.396  Århus  Denmark   57.05N    10.33E

In [42]:
df.describe()

           Avg_temp  Avg_temp_cert
count  8.235082e+06   8.235082e+06
mean   1.672743e+01   1.028575e+00
std    1.035344e+01   1.129733e+00
min   -4.270400e+01   3.400000e-02
25%    1.029900e+01   3.370000e-01
50%    1.883100e+01   5.910000e-01
75%    2.521000e+01   1.349000e+00
max    3.965100e+01   1.539600e+01

In [45]:
df[['Country','Avg_temp']].groupby(['Country']).mean().sort_values('Avg_temp')

               Avg_temp
Country
Mongolia      -3.365485
Iceland        1.500089
Russia         3.347268
Norway         3.612553
Finland        3.711645
...                 ...
Mali          27.590491
Burkina Faso  27.815295
Sudan         28.072831
Niger         28.145552
Djibouti      29.152790

[159 rows x 1 columns]

In [3]:
pd. __version__

'1.3.4'